from graph_creation import create_graph
from graph_algorithms import dfs, bfs

# Створення графа
G = create_graph()

# Знаходимо шляхи для графа G
dfs_path = dfs(G, "Kyiv")
bfs_path = bfs(G, "Kyiv")

print(f"Шлях BFS: {bfs_path}")
print(f"Шлях DFS: {dfs_path}")

# Пояснення різниці шляхів
dfs_explanation = """

BFS (Пошук у ширину) досліджує всі сусідні вершини на кожному рівні, перш ніж переходити до наступного рівня. 
Це забезпечує коротші та більш оптимальні шляхи, але може вимагати більше пам'яті для зберігання черг.

DFS (Пошук у глибину) досліджує якомога глибше з кожної вершини перед переходом до наступної. 
Це може призвести до більш довгих та менш оптимальних шляхів, але забезпечує всебічне дослідження.

"""

print(dfs_explanation)
